programming/java/code/beginning/15.org
#+title: ch15 - A Collection of Useful Classes
#+options: num:nil ^:nil creator:nil author:nil timestamp:nil

# suc, bs, obs

* 1.TryRegex

** =output=

#+BEGIN_EXAMPLE
  Smith, where Jones had had 'had', had had 'had had'.
                     ^^^ ^^^  ^^^   ^^^ ^^^  ^^^ ^^^  
#+END_EXAMPLE

** =TryRegexOne.java=

#+BEGIN_SRC java -n :tangle TryRegexOne.java :padline no
  import java.util.Arrays;
  import java.util.regex.Matcher;
  import java.util.regex.Pattern;

  class TryRegexOne {

    public static void main(String[] args) {
      //  A regex and a string in which to search are specified
      String regEx = "had";
      String str = "Smith, where Jones had had 'had', had had 'had had'.";

      // The matches in the output will be marked (fixed-width font
      // required)
      char[] marker = new char[str.length()];
      Arrays.fill(marker, ' '); // So we can later replace spaces with marker characters

      //  Obtain the required matcher
      Pattern pattern = Pattern.compile(regEx);
      Matcher m = pattern.matcher(str);

      // Find every match and mark it
      while (m.find()) {
        System.out.println("Pattern found at Start: " + m.start() + " End: " + m.end());
        Arrays.fill(marker, m.start(), m.end(), '^');
      }

      // Show the object string with matches marked under it
      System.out.println(str);
      System.out.println(new String(marker));
    }
  }
#+END_SRC

* 2.TryRegex

** =output=

#+BEGIN_EXAMPLE
  Ted and Ned Hodge hid their hod and huddled in the hedge.
                    ^^^       ^^^     ^^^            ^^^   
#+END_EXAMPLE

