programming/java/code/beginning/15.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ch15 - A Collection of Useful Classes</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">ch15 - A Collection of Useful Classes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgde4e891">1.TryRegex</a>
<ul>
<li><a href="#org9bdab74"><code>output</code></a></li>
<li><a href="#orgb38bb4a"><code>TryRegexOne.java</code></a></li>
</ul>
</li>
<li><a href="#orgcd181b5">2.TryRegex</a>
<ul>
<li><a href="#org1c9d3e5"><code>output</code></a></li>
<li><a href="#orga3d9432"><code>TryRegexTwo.java</code></a></li>
</ul>
</li>
<li><a href="#org01f64f3">3.TryRegex</a>
<ul>
<li><a href="#orgfaa43ee"><code>output</code></a></li>
<li><a href="#org75c6852"><code>TryRegexThree.java</code></a></li>
</ul>
</li>
<li><a href="#org789d73c">4.TryRegex</a>
<ul>
<li><a href="#orga45fa40"><code>output</code></a></li>
<li><a href="#orgba811d0"><code>TryRegexFour.java</code></a></li>
</ul>
</li>
<li><a href="#org92a28c0">5.TryRegex</a>
<ul>
<li><a href="#orgcaa54ff"><code>output</code></a></li>
<li><a href="#orgd3dde30"><code>TryRegexFive.java</code></a></li>
</ul>
</li>
<li><a href="#org2924169">6.TryRegex</a>
<ul>
<li><a href="#org90a491d"><code>output</code></a></li>
<li><a href="#org1cb79d4"><code>TryRegexSix.java</code></a></li>
</ul>
</li>
<li><a href="#orgf81c18a">Dice</a>
<ul>
<li><a href="#org9e89eb2"><code>output</code></a></li>
<li><a href="#org4ad12db"><code>Dice.java</code></a></li>
</ul>
</li>
<li><a href="#org89edea3">FindingIntegers</a>
<ul>
<li><a href="#orgab983e1"><code>output</code></a></li>
<li><a href="#orgf0226bc"><code>FindingIntegers.java</code></a></li>
</ul>
</li>
<li><a href="#org24f0245">RearrangeText</a>
<ul>
<li><a href="#org45def45"><code>output</code></a></li>
<li><a href="#org27ddd73"><code>RearrangeText.java</code></a></li>
</ul>
</li>
<li><a href="#org234fa75">ScanString</a>
<ul>
<li><a href="#orgd98332a"><code>output</code></a></li>
<li><a href="#org8725458"><code>ScanString.java</code></a></li>
</ul>
</li>
<li><a href="#org6e0d370">SearchAndReplace</a>
<ul>
<li><a href="#org6970a32"><code>output</code></a></li>
<li><a href="#org1eba874"><code>SearchAndReplace.java</code></a></li>
</ul>
</li>
<li><a href="#org9128d92">SortingUsingComparator</a>
<ul>
<li><a href="#orga17b27f"><code>output</code></a></li>
<li><a href="#org18d465c"><code>ComparePersons.java</code></a></li>
<li><a href="#org7652da2"><code>Person.java</code></a></li>
<li><a href="#org49cce7d"><code>TrySortingWithComparator.java</code></a></li>
</ul>
</li>
<li><a href="#orge6ae53f">StringTokenizing</a>
<ul>
<li><a href="#orga799730"><code>output</code></a></li>
<li><a href="#orga99e104"><code>StringTokenizing.java</code></a></li>
</ul>
</li>
<li><a href="#orgb04eacf">BinarySearch</a>
<ul>
<li><a href="#orgd184eea"><code>output</code></a></li>
<li><a href="#org86bdc8e"><code>Person.java</code></a></li>
<li><a href="#orga87554b"><code>TryBinarySearch.java</code></a></li>
</ul>
</li>
<li><a href="#org2cfb004">Calendar</a>
<ul>
<li><a href="#org1a69f92"><code>output</code></a></li>
<li><a href="#org72ef07b"><code>FormattedInput.java</code></a></li>
<li><a href="#org7e1d69c"><code>InvalidUserInputException.java</code></a></li>
<li><a href="#org6ca6ca1"><code>TryCalendar.java</code></a></li>
</ul>
</li>
<li><a href="#orgd1839e7">CapturingGroups</a>
<ul>
<li><a href="#org9d7d8bb"><code>output</code></a></li>
<li><a href="#org350d8b6"><code>TryCapturingGroups.java</code></a></li>
</ul>
</li>
<li><a href="#orgb4d7dc2">DateFormats</a>
<ul>
<li><a href="#org3b33b7b"><code>output</code></a></li>
<li><a href="#org4699dd6"><code>TryDateFormats.java</code></a></li>
</ul>
</li>
<li><a href="#org8bda4b9">Observer</a>
<ul>
<li><a href="#orgb76c0c0"><code>output</code></a></li>
<li><a href="#orgfdb545c"><code>Horrific.java</code></a></li>
<li><a href="#org0545fbd"><code>JekyllAndHyde.java</code></a></li>
<li><a href="#org3ce831c"><code>Person.java</code></a></li>
</ul>
</li>
<li><a href="#orgdd058ae">Scanner</a>
<ul>
<li><a href="#org5ee151b"><code>output</code></a></li>
<li><a href="#orga330ca3"><code>TryScanner.java</code></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgde4e891" class="outline-2">
<h2 id="orgde4e891">1.TryRegex</h2>
<div class="outline-text-2" id="text-orgde4e891">
</div>
<div id="outline-container-org9bdab74" class="outline-3">
<h3 id="org9bdab74"><code>output</code></h3>
<div class="outline-text-3" id="text-org9bdab74">
<pre class="example">
Smith, where Jones had had 'had', had had 'had had'.
                   ^^^ ^^^  ^^^   ^^^ ^^^  ^^^ ^^^  
</pre>
</div>
</div>

<div id="outline-container-orgb38bb4a" class="outline-3">
<h3 id="orgb38bb4a"><code>TryRegexOne.java</code></h3>
<div class="outline-text-3" id="text-orgb38bb4a">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Arrays</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Matcher</span>;
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Pattern</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">TryRegexOne</span> {
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 8: </span>    <span style="color: #009e73; font-style: italic;">//  </span><span style="color: #009e73; font-style: italic;">A regex and a string in which to search are specified</span>
<span class="linenr"> 9: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">regEx</span> = <span style="color: #848ea9;">"had"</span>;
<span class="linenr">10: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">str</span> = <span style="color: #848ea9;">"Smith, where Jones had had 'had', had had 'had had'."</span>;
<span class="linenr">11: </span>
<span class="linenr">12: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">The matches in the output will be marked (fixed-width font</span>
<span class="linenr">13: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">required)</span>
<span class="linenr">14: </span>    <span style="color: #0072b2; font-weight: bold;">char</span>[] <span style="color: #e69f00; font-weight: bold;">marker</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">char</span>[str.length()];
<span class="linenr">15: </span>    Arrays.fill(marker, <span style="color: #848ea9;">' '</span>); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">So we can later replace spaces with marker characters</span>
<span class="linenr">16: </span>
<span class="linenr">17: </span>    <span style="color: #009e73; font-style: italic;">//  </span><span style="color: #009e73; font-style: italic;">Obtain the required matcher</span>
<span class="linenr">18: </span>    <span style="color: #0072b2; font-weight: bold;">Pattern</span> <span style="color: #e69f00; font-weight: bold;">pattern</span> = Pattern.compile(regEx);
<span class="linenr">19: </span>    <span style="color: #0072b2; font-weight: bold;">Matcher</span> <span style="color: #e69f00; font-weight: bold;">m</span> = pattern.matcher(str);
<span class="linenr">20: </span>
<span class="linenr">21: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Find every match and mark it</span>
<span class="linenr">22: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (m.find()) {
<span class="linenr">23: </span>      System.out.println(<span style="color: #848ea9;">"Pattern found at Start: "</span> + m.start() + <span style="color: #848ea9;">" End: "</span> + m.end());
<span class="linenr">24: </span>      Arrays.fill(marker, m.start(), m.end(), <span style="color: #848ea9;">'^'</span>);
<span class="linenr">25: </span>    }
<span class="linenr">26: </span>
<span class="linenr">27: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Show the object string with matches marked under it</span>
<span class="linenr">28: </span>    System.out.println(str);
<span class="linenr">29: </span>    System.out.println(<span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">String</span>(marker));
<span class="linenr">30: </span>  }
<span class="linenr">31: </span>}
</pre>
</div>
</div>
</div>
</div>
