programming/java/code/beginning/15.html

<div id="outline-container-orgcd181b5" class="outline-2">
<h2 id="orgcd181b5">2.TryRegex</h2>
<div class="outline-text-2" id="text-orgcd181b5">
</div>
<div id="outline-container-org1c9d3e5" class="outline-3">
<h3 id="org1c9d3e5"><code>output</code></h3>
<div class="outline-text-3" id="text-org1c9d3e5">
<pre class="example">
Ted and Ned Hodge hid their hod and huddled in the hedge.
                  ^^^       ^^^     ^^^            ^^^   
</pre>
</div>
</div>

<div id="outline-container-orga3d9432" class="outline-3">
<h3 id="orga3d9432"><code>TryRegexTwo.java</code></h3>
<div class="outline-text-3" id="text-orga3d9432">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Arrays</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Matcher</span>;
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Pattern</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">TryRegexTwo</span> {
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>    <span style="color: #009e73; font-style: italic;">//  </span><span style="color: #009e73; font-style: italic;">A regex and a string in which to search are specified</span>
<span class="linenr">10: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">regEx</span> = <span style="color: #848ea9;">"h.d"</span>;
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">str</span> = <span style="color: #848ea9;">"Ted and Ned Hodge hid their hod and huddled in the hedge."</span>;
<span class="linenr">12: </span>
<span class="linenr">13: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">The matches in the output will be marked (fixed-width font required)</span>
<span class="linenr">14: </span>    <span style="color: #0072b2; font-weight: bold;">char</span>[] <span style="color: #e69f00; font-weight: bold;">marker</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">char</span>[str.length()];
<span class="linenr">15: </span>    Arrays.fill(marker, <span style="color: #848ea9;">' '</span>); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">So we can later replace spaces with marker characters</span>
<span class="linenr">16: </span>
<span class="linenr">17: </span>    <span style="color: #009e73; font-style: italic;">//  </span><span style="color: #009e73; font-style: italic;">Obtain the required matcher</span>
<span class="linenr">18: </span>    <span style="color: #0072b2; font-weight: bold;">Pattern</span> <span style="color: #e69f00; font-weight: bold;">pattern</span> = Pattern.compile(regEx);
<span class="linenr">19: </span>    <span style="color: #0072b2; font-weight: bold;">Matcher</span> <span style="color: #e69f00; font-weight: bold;">m</span> = pattern.matcher(str);
<span class="linenr">20: </span>
<span class="linenr">21: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Find every match and mark it</span>
<span class="linenr">22: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (m.find()) {
<span class="linenr">23: </span>      <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">System.out.println("Pattern found at Start: " + m.start() + " End: " + m.end());</span>
<span class="linenr">24: </span>      Arrays.fill(marker, m.start(), m.end(), <span style="color: #848ea9;">'^'</span>);
<span class="linenr">25: </span>    }
<span class="linenr">26: </span>
<span class="linenr">27: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Show the object string with matches marked under it</span>
<span class="linenr">28: </span>    System.out.println(str);
<span class="linenr">29: </span>    System.out.println(<span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">String</span>(marker));
<span class="linenr">30: </span>  }
<span class="linenr">31: </span>}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org01f64f3" class="outline-2">
<h2 id="org01f64f3">3.TryRegex</h2>
<div class="outline-text-2" id="text-org01f64f3">
</div>
<div id="outline-container-orgfaa43ee" class="outline-3">
<h3 id="orgfaa43ee"><code>output</code></h3>
<div class="outline-text-3" id="text-orgfaa43ee">
<pre class="example">
Ted and Ned Hodge hid their hod and huddled in the hedge.
                  ^^^       ^^^                          
</pre>
</div>
</div>

<div id="outline-container-org75c6852" class="outline-3">
<h3 id="org75c6852"><code>TryRegexThree.java</code></h3>
<div class="outline-text-3" id="text-org75c6852">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Arrays</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Matcher</span>;
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Pattern</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">TryRegexThree</span> {
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">A regex and a string in which to search are specified</span>
<span class="linenr">10: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">regEx</span> = <span style="color: #848ea9;">"h[aio]d"</span>;
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">str</span> = <span style="color: #848ea9;">"Ted and Ned Hodge hid their hod and huddled in the hedge."</span>;
<span class="linenr">12: </span>
<span class="linenr">13: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">The matches in the output will be marked (fixed-width font required)</span>
<span class="linenr">14: </span>    <span style="color: #0072b2; font-weight: bold;">char</span>[] <span style="color: #e69f00; font-weight: bold;">marker</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">char</span>[str.length()];
<span class="linenr">15: </span>    Arrays.fill(marker, <span style="color: #848ea9;">' '</span>); <span style="color: #009e73; font-style: italic;">//  </span><span style="color: #009e73; font-style: italic;">So we can later replace spaces with marker characters</span>
<span class="linenr">16: </span>
<span class="linenr">17: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Obtain the required matcher</span>
<span class="linenr">18: </span>    <span style="color: #0072b2; font-weight: bold;">Pattern</span> <span style="color: #e69f00; font-weight: bold;">pattern</span> = Pattern.compile(regEx);
<span class="linenr">19: </span>    <span style="color: #0072b2; font-weight: bold;">Matcher</span> <span style="color: #e69f00; font-weight: bold;">m</span> = pattern.matcher(str);
<span class="linenr">20: </span>
<span class="linenr">21: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Find every match and mark it</span>
<span class="linenr">22: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (m.find()) {
<span class="linenr">23: </span>      System.out.println(<span style="color: #848ea9;">"Pattern found at Start: "</span> + m.start() + <span style="color: #848ea9;">" End: "</span> + m.end());
<span class="linenr">24: </span>      Arrays.fill(marker, m.start(), m.end(), <span style="color: #848ea9;">'^'</span>);
<span class="linenr">25: </span>    }
<span class="linenr">26: </span>
<span class="linenr">27: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Show the object string with matches marked under it</span>
<span class="linenr">28: </span>    System.out.println(str);
<span class="linenr">29: </span>    System.out.println(<span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">String</span>(marker));
<span class="linenr">30: </span>  }
<span class="linenr">31: </span>}
</pre>
</div>
</div>
</div>
</div>
