programming/java/code/beginning/15.html

<div id="outline-container-org789d73c" class="outline-2">
<h2 id="org789d73c">4.TryRegex</h2>
<div class="outline-text-2" id="text-org789d73c">
</div>
<div id="outline-container-orga45fa40" class="outline-3">
<h3 id="orga45fa40"><code>output</code></h3>
<div class="outline-text-3" id="text-orga45fa40">
<pre class="example">
Ted and Ned Hodge hid their hod and huddled in the hedge.
            ^^^   ^^^       ^^^     ^^^            ^^^   
</pre>
</div>
</div>

<div id="outline-container-orgba811d0" class="outline-3">
<h3 id="orgba811d0"><code>TryRegexFour.java</code></h3>
<div class="outline-text-3" id="text-orgba811d0">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Arrays</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Matcher</span>;
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Pattern</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">TryRegexFour</span> {
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 7: </span>    <span style="color: #009e73; font-style: italic;">//  </span><span style="color: #009e73; font-style: italic;">A regex and a string in which to search are specified</span>
<span class="linenr"> 8: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">regEx</span> = <span style="color: #848ea9;">"[h|H][aeiou]d"</span>;
<span class="linenr"> 9: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">str</span> = <span style="color: #848ea9;">"Ted and Ned Hodge hid their hod and huddled in the hedge."</span>;
<span class="linenr">10: </span>
<span class="linenr">11: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">The matches in the output will be marked (fixed-width font required)</span>
<span class="linenr">12: </span>    <span style="color: #0072b2; font-weight: bold;">char</span>[] <span style="color: #e69f00; font-weight: bold;">marker</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">char</span>[str.length()];
<span class="linenr">13: </span>    Arrays.fill(marker, <span style="color: #848ea9;">' '</span>); <span style="color: #009e73; font-style: italic;">//  </span><span style="color: #009e73; font-style: italic;">So we can later replace spaces with marker characters</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span>    <span style="color: #009e73; font-style: italic;">//  </span><span style="color: #009e73; font-style: italic;">Obtain the required matcher</span>
<span class="linenr">16: </span>    <span style="color: #0072b2; font-weight: bold;">Pattern</span> <span style="color: #e69f00; font-weight: bold;">pattern</span> = Pattern.compile(regEx);
<span class="linenr">17: </span>    <span style="color: #0072b2; font-weight: bold;">Matcher</span> <span style="color: #e69f00; font-weight: bold;">m</span> = pattern.matcher(str);
<span class="linenr">18: </span>
<span class="linenr">19: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Find every match and mark it</span>
<span class="linenr">20: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (m.find()) {
<span class="linenr">21: </span>      <span style="color: #009e73; font-style: italic;">//      </span><span style="color: #009e73; font-style: italic;">System.out.println("Pattern found at Start: "+m.start()+" End: "+m.end());</span>
<span class="linenr">22: </span>      Arrays.fill(marker, m.start(), m.end(), <span style="color: #848ea9;">'^'</span>);
<span class="linenr">23: </span>    }
<span class="linenr">24: </span>
<span class="linenr">25: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Show the object string with matches marked under it</span>
<span class="linenr">26: </span>    System.out.println(str);
<span class="linenr">27: </span>    System.out.println(<span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">String</span>(marker));
<span class="linenr">28: </span>  }
<span class="linenr">29: </span>}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org92a28c0" class="outline-2">
<h2 id="org92a28c0">5.TryRegex</h2>
<div class="outline-text-2" id="text-org92a28c0">
</div>
<div id="outline-container-orgcaa54ff" class="outline-3">
<h3 id="orgcaa54ff"><code>output</code></h3>
<div class="outline-text-3" id="text-orgcaa54ff">
<pre class="example">
Ted and Ned Hodge hid their hod and huddled in the hedge.
                 ^^^^^     ^^^^^                         
</pre>
</div>
</div>

<div id="outline-container-orgd3dde30" class="outline-3">
<h3 id="orgd3dde30"><code>TryRegexFive.java</code></h3>
<div class="outline-text-3" id="text-orgd3dde30">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Arrays</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Matcher</span>;
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Pattern</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">TryRegexFive</span> {
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 7: </span>    <span style="color: #009e73; font-style: italic;">//  </span><span style="color: #009e73; font-style: italic;">A regex and a string in which to search are specified</span>
<span class="linenr"> 8: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">regEx</span> = <span style="color: #848ea9;">"\\sh.d\\s"</span>;
<span class="linenr"> 9: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">str</span> = <span style="color: #848ea9;">"Ted and Ned Hodge hid their hod and huddled in the hedge."</span>;
<span class="linenr">10: </span>
<span class="linenr">11: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">The matches in the output will be marked (fixed-width font required)</span>
<span class="linenr">12: </span>    <span style="color: #0072b2; font-weight: bold;">char</span>[] <span style="color: #e69f00; font-weight: bold;">marker</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">char</span>[str.length()];
<span class="linenr">13: </span>    Arrays.fill(marker, <span style="color: #848ea9;">' '</span>); <span style="color: #009e73; font-style: italic;">//  </span><span style="color: #009e73; font-style: italic;">So we can later replace spaces with marker characters</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span>    <span style="color: #009e73; font-style: italic;">//  </span><span style="color: #009e73; font-style: italic;">Obtain the required matcher</span>
<span class="linenr">16: </span>    <span style="color: #0072b2; font-weight: bold;">Pattern</span> <span style="color: #e69f00; font-weight: bold;">pattern</span> = Pattern.compile(regEx);
<span class="linenr">17: </span>    <span style="color: #0072b2; font-weight: bold;">Matcher</span> <span style="color: #e69f00; font-weight: bold;">m</span> = pattern.matcher(str);
<span class="linenr">18: </span>
<span class="linenr">19: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Find every match and mark it</span>
<span class="linenr">20: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (m.find()) {
<span class="linenr">21: </span>      <span style="color: #009e73; font-style: italic;">//      </span><span style="color: #009e73; font-style: italic;">System.out.println("Pattern found at Start: "+m.start()+" End: "+m.end());</span>
<span class="linenr">22: </span>      Arrays.fill(marker, m.start(), m.end(), <span style="color: #848ea9;">'^'</span>);
<span class="linenr">23: </span>    }
<span class="linenr">24: </span>
<span class="linenr">25: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Show the object string with matches marked under it</span>
<span class="linenr">26: </span>    System.out.println(str);
<span class="linenr">27: </span>    System.out.println(<span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">String</span>(marker));
<span class="linenr">28: </span>  }
<span class="linenr">29: </span>}
</pre>
</div>
</div>
</div>
</div>
