programming/java/code/beginning/15.org
** =TryRegexSix.java=

#+BEGIN_SRC java -n :tangle TryRegexSix.java :padline no
  import java.util.Arrays;
  import java.util.regex.Matcher;
  import java.util.regex.Pattern;

  class TryRegexSix {
    public static void main(String[] args) {
      //  A regex and a string in which to search are specified
      String regEx = "\\s[h|H][e|o]dge[\\s|\\.]";
      String str = "Ted and Ned Hodge hid their hod and huddled in the hedge.";

      // The matches in the output will be marked (fixed-width font required)
      char[] marker = new char[str.length()];
      Arrays.fill(marker, ' '); //  So we can later replace spaces with marker characters

      //  Obtain the required matcher
      Pattern pattern = Pattern.compile(regEx);
      Matcher m = pattern.matcher(str);

      // Find every match and mark it
      while (m.find()) {
        //      System.out.println("Pattern found at Start: "+m.start()+" End: "+m.end());
        Arrays.fill(marker, m.start(), m.end(), '^');
      }

      // Show the object string with matches marked under it
      System.out.println(str);
      System.out.println(new String(marker));
    }
  }
#+END_SRC

* Dice

** =output=

#+BEGIN_EXAMPLE
  You have six throws of a pair of dice.
  The objective is to get a double six. Here goes...

  First throw: 4, 2
  Second throw: 4, 5
  Third throw: 4, 3
  Fourth throw: 2, 5
  Fifth throw: 6, 6
      You win!!
#+END_EXAMPLE

** =Dice.java=

#+BEGIN_SRC java -n :tangle Dice.java :padline no
  import java.util.Random;

  public class Dice {

    public static void main(String[] args) {
      System.out.println(
          "You have six throws of a pair of dice.\n"
              + "The objective is to get a double six. Here goes...\n");

      Random diceValues = new Random(); // Random number generator
      String[] goes = {
        "First", "Second", "Third",
        "Fourth", "Fifth", "Sixth"
      };
      int die1 = 0; // First die value
      int die2 = 0; // Second die value

      for (String go : goes) {
        die1 = 1 + diceValues.nextInt(6); // Number from 1 to 6
        die2 = 1 + diceValues.nextInt(6); // Number from 1 to 6
        System.out.println(go + " throw: " + die1 + ", " + die2);

        if (die1 + die2 == 12) { // Is it double 6?
          System.out.println("    You win!!"); // Yes !!!
          return;
        }
      }
      System.out.println("Sorry, you lost...");
      return;
    }
  }
#+END_SRC

* FindingIntegers

** =output=

#+BEGIN_EXAMPLE
  256
  16
  -2.5
  6.25
  .243
  0.1234
#+END_EXAMPLE

