programming/java/code/beginning/15.html

<div id="outline-container-org2924169" class="outline-2">
<h2 id="org2924169">6.TryRegex</h2>
<div class="outline-text-2" id="text-org2924169">
</div>
<div id="outline-container-org90a491d" class="outline-3">
<h3 id="org90a491d"><code>output</code></h3>
<div class="outline-text-3" id="text-org90a491d">
<pre class="example">
Ted and Ned Hodge hid their hod and huddled in the hedge.
           ^^^^^^^                                ^^^^^^^
</pre>
</div>
</div>

<div id="outline-container-org1cb79d4" class="outline-3">
<h3 id="org1cb79d4"><code>TryRegexSix.java</code></h3>
<div class="outline-text-3" id="text-org1cb79d4">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Arrays</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Matcher</span>;
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Pattern</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">TryRegexSix</span> {
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 7: </span>    <span style="color: #009e73; font-style: italic;">//  </span><span style="color: #009e73; font-style: italic;">A regex and a string in which to search are specified</span>
<span class="linenr"> 8: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">regEx</span> = <span style="color: #848ea9;">"\\s[h|H][e|o]dge[\\s|\\.]"</span>;
<span class="linenr"> 9: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">str</span> = <span style="color: #848ea9;">"Ted and Ned Hodge hid their hod and huddled in the hedge."</span>;
<span class="linenr">10: </span>
<span class="linenr">11: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">The matches in the output will be marked (fixed-width font required)</span>
<span class="linenr">12: </span>    <span style="color: #0072b2; font-weight: bold;">char</span>[] <span style="color: #e69f00; font-weight: bold;">marker</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">char</span>[str.length()];
<span class="linenr">13: </span>    Arrays.fill(marker, <span style="color: #848ea9;">' '</span>); <span style="color: #009e73; font-style: italic;">//  </span><span style="color: #009e73; font-style: italic;">So we can later replace spaces with marker characters</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span>    <span style="color: #009e73; font-style: italic;">//  </span><span style="color: #009e73; font-style: italic;">Obtain the required matcher</span>
<span class="linenr">16: </span>    <span style="color: #0072b2; font-weight: bold;">Pattern</span> <span style="color: #e69f00; font-weight: bold;">pattern</span> = Pattern.compile(regEx);
<span class="linenr">17: </span>    <span style="color: #0072b2; font-weight: bold;">Matcher</span> <span style="color: #e69f00; font-weight: bold;">m</span> = pattern.matcher(str);
<span class="linenr">18: </span>
<span class="linenr">19: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Find every match and mark it</span>
<span class="linenr">20: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (m.find()) {
<span class="linenr">21: </span>      <span style="color: #009e73; font-style: italic;">//      </span><span style="color: #009e73; font-style: italic;">System.out.println("Pattern found at Start: "+m.start()+" End: "+m.end());</span>
<span class="linenr">22: </span>      Arrays.fill(marker, m.start(), m.end(), <span style="color: #848ea9;">'^'</span>);
<span class="linenr">23: </span>    }
<span class="linenr">24: </span>
<span class="linenr">25: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Show the object string with matches marked under it</span>
<span class="linenr">26: </span>    System.out.println(str);
<span class="linenr">27: </span>    System.out.println(<span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">String</span>(marker));
<span class="linenr">28: </span>  }
<span class="linenr">29: </span>}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf81c18a" class="outline-2">
<h2 id="orgf81c18a">Dice</h2>
<div class="outline-text-2" id="text-orgf81c18a">
</div>
<div id="outline-container-org9e89eb2" class="outline-3">
<h3 id="org9e89eb2"><code>output</code></h3>
<div class="outline-text-3" id="text-org9e89eb2">
<pre class="example">
You have six throws of a pair of dice.
The objective is to get a double six. Here goes...

First throw: 4, 2
Second throw: 4, 5
Third throw: 4, 3
Fourth throw: 2, 5
Fifth throw: 6, 6
    You win!!
</pre>
</div>
</div>

<div id="outline-container-org4ad12db" class="outline-3">
<h3 id="org4ad12db"><code>Dice.java</code></h3>
<div class="outline-text-3" id="text-org4ad12db">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Random</span>;
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Dice</span> {
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 6: </span>    System.out.println(
<span class="linenr"> 7: </span>        <span style="color: #848ea9;">"You have six throws of a pair of dice.\n"</span>
<span class="linenr"> 8: </span>            + <span style="color: #848ea9;">"The objective is to get a double six. Here goes...\n"</span>);
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    <span style="color: #0072b2; font-weight: bold;">Random</span> <span style="color: #e69f00; font-weight: bold;">diceValues</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Random</span>(); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Random number generator</span>
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">goes</span> = {
<span class="linenr">12: </span>      <span style="color: #848ea9;">"First"</span>, <span style="color: #848ea9;">"Second"</span>, <span style="color: #848ea9;">"Third"</span>,
<span class="linenr">13: </span>      <span style="color: #848ea9;">"Fourth"</span>, <span style="color: #848ea9;">"Fifth"</span>, <span style="color: #848ea9;">"Sixth"</span>
<span class="linenr">14: </span>    };
<span class="linenr">15: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">die1</span> = 0; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">First die value</span>
<span class="linenr">16: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">die2</span> = 0; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Second die value</span>
<span class="linenr">17: </span>
<span class="linenr">18: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">go</span> : goes) {
<span class="linenr">19: </span>      die1 = 1 + diceValues.nextInt(6); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Number from 1 to 6</span>
<span class="linenr">20: </span>      die2 = 1 + diceValues.nextInt(6); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Number from 1 to 6</span>
<span class="linenr">21: </span>      System.out.println(go + <span style="color: #848ea9;">" throw: "</span> + die1 + <span style="color: #848ea9;">", "</span> + die2);
<span class="linenr">22: </span>
<span class="linenr">23: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (die1 + die2 == 12) { <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Is it double 6?</span>
<span class="linenr">24: </span>        System.out.println(<span style="color: #848ea9;">"    You win!!"</span>); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Yes !!!</span>
<span class="linenr">25: </span>        <span style="color: #56b4e9; font-weight: bold;">return</span>;
<span class="linenr">26: </span>      }
<span class="linenr">27: </span>    }
<span class="linenr">28: </span>    System.out.println(<span style="color: #848ea9;">"Sorry, you lost..."</span>);
<span class="linenr">29: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span>;
<span class="linenr">30: </span>  }
<span class="linenr">31: </span>}
</pre>
</div>
</div>
</div>
</div>
