programming/java/code/beginning/15.org
** =FindingIntegers.java=

#+BEGIN_SRC java -n :tangle FindingIntegers.java :padline no
  import java.util.regex.Matcher;
  import java.util.regex.Pattern;

  public class FindingIntegers {

    public static void main(String[] args) {

      String regEx = "[+|-]?(\\d+(\\.\\d*)?)|(\\.\\d+)";
      String str =
          "256 is the square of 16 and -2.5 squared is 6.25 " + "and -.243 is less than 0.1234.";
      Pattern pattern = Pattern.compile(regEx);
      Matcher m = pattern.matcher(str);
      int i = 0;
      String subStr = null;
      while (m.find()) {
        System.out.println(m.group()); // Output the substring matched
      }
    }
  }
#+END_SRC

* RearrangeText

** =output=

#+BEGIN_EXAMPLE
  Original Code:
  double result = Math.pow( 3.0, 16.0); 
  double resultSquared = Math.pow(2 ,result );
  double hypotenuse = Math.sqrt(Math.pow(2.0, 30.0)+Math.pow(2 , 40.0));

  New Code:
  double result = Math.pow(16.0,3.0); 
  double resultSquared = Math.pow(result,2);
  double hypotenuse = Math.sqrt(Math.pow(30.0,2.0)+Math.pow(40.0,2));
#+END_EXAMPLE

** =RearrangeText.java=

#+BEGIN_SRC java -n :tangle RearrangeText.java :padline no
  import java.util.regex.Matcher;
  import java.util.regex.Pattern;

  public class RearrangeText {

    public static void main(String[] args) {
      String regEx =
          "(Math.pow)" // Math.pow
              + "\\s*\\(" // Opening parenthesis
              + "\\s*([+|-]?(\\d+\\.?\\d*|\\.\\d+)|([a-zA-Z]\\w*))" // First argument
              + "\\s*,\\s*" // Comma
              + "([+|-]?(\\d+\\.?\\d*|\\.\\d+)|([a-zA-Z]\\w*))" // Second argument
              + "\\s*\\)"; // Closing parenthesis

      // String regEx =
      // "(Math.pow)\\s*\\(\\s*([+|-]?(\\d+\\.?\\d*|\\.\\d+)|([a-zA-Z]\\w*))\\s*,\\s*([+|-]?(\\d+\\.?\\d*|\\.\\d+)|([a-zA-Z]\\w*))\\s*\\)";
      String oldCode =
          "double result = Math.pow( 3.0, 16.0); "
              + "\ndouble resultSquared = Math.pow(2 ,result );"
              + "\ndouble hypotenuse = Math.sqrt(Math.pow(2.0, 30.0)+Math.pow(2 , 40.0));";
      Pattern pattern = Pattern.compile(regEx);
      Matcher m = pattern.matcher(oldCode);

      StringBuffer newCode = new StringBuffer();
      while (m.find()) {
        m.appendReplacement(newCode, "$1\\($5,$2\\)");
      }
      m.appendTail(newCode);

      System.out.println("Original Code:\n" + oldCode.toString());
      System.out.println("\nNew Code:\n" + newCode.toString());
    }
  }
#+END_SRC

* ScanString

** =output=

#+BEGIN_EXAMPLE
  String is:
  Smith , where Jones had had 'had', had had 'had had'.
  Token sought is: had
  Token is    : Smith
  Token is    : ,
  Token is    : where
  Token is    : Jones
  Token found!: had
  Token found!: had
  Token is    : 'had',
  Token found!: had
  Token found!: had
  Token is    : 'had
  Token is    : had'.
  4 instances of "had" were found.
#+END_EXAMPLE

