programming/java/code/beginning/15.html

<div id="outline-container-org89edea3" class="outline-2">
<h2 id="org89edea3">FindingIntegers</h2>
<div class="outline-text-2" id="text-org89edea3">
</div>
<div id="outline-container-orgab983e1" class="outline-3">
<h3 id="orgab983e1"><code>output</code></h3>
<div class="outline-text-3" id="text-orgab983e1">
<pre class="example">
256
16
-2.5
6.25
.243
0.1234
</pre>
</div>
</div>

<div id="outline-container-orgf0226bc" class="outline-3">
<h3 id="orgf0226bc"><code>FindingIntegers.java</code></h3>
<div class="outline-text-3" id="text-orgf0226bc">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Matcher</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Pattern</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">FindingIntegers</span> {
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">regEx</span> = <span style="color: #848ea9;">"[+|-]?(\\d+(\\.\\d*)?)|(\\.\\d+)"</span>;
<span class="linenr"> 9: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">str</span> =
<span class="linenr">10: </span>        <span style="color: #848ea9;">"256 is the square of 16 and -2.5 squared is 6.25 "</span> + <span style="color: #848ea9;">"and -.243 is less than 0.1234."</span>;
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">Pattern</span> <span style="color: #e69f00; font-weight: bold;">pattern</span> = Pattern.compile(regEx);
<span class="linenr">12: </span>    <span style="color: #0072b2; font-weight: bold;">Matcher</span> <span style="color: #e69f00; font-weight: bold;">m</span> = pattern.matcher(str);
<span class="linenr">13: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span> = 0;
<span class="linenr">14: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">subStr</span> = <span style="color: #d55e00; font-weight: bold;">null</span>;
<span class="linenr">15: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (m.find()) {
<span class="linenr">16: </span>      System.out.println(m.group()); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Output the substring matched</span>
<span class="linenr">17: </span>    }
<span class="linenr">18: </span>  }
<span class="linenr">19: </span>}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org24f0245" class="outline-2">
<h2 id="org24f0245">RearrangeText</h2>
<div class="outline-text-2" id="text-org24f0245">
</div>
<div id="outline-container-org45def45" class="outline-3">
<h3 id="org45def45"><code>output</code></h3>
<div class="outline-text-3" id="text-org45def45">
<pre class="example">
Original Code:
double result = Math.pow( 3.0, 16.0); 
double resultSquared = Math.pow(2 ,result );
double hypotenuse = Math.sqrt(Math.pow(2.0, 30.0)+Math.pow(2 , 40.0));

New Code:
double result = Math.pow(16.0,3.0); 
double resultSquared = Math.pow(result,2);
double hypotenuse = Math.sqrt(Math.pow(30.0,2.0)+Math.pow(40.0,2));
</pre>
</div>
</div>

<div id="outline-container-org27ddd73" class="outline-3">
<h3 id="org27ddd73"><code>RearrangeText.java</code></h3>
<div class="outline-text-3" id="text-org27ddd73">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Matcher</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Pattern</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">RearrangeText</span> {
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">regEx</span> =
<span class="linenr"> 8: </span>        <span style="color: #848ea9;">"(Math.pow)"</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Math.pow</span>
<span class="linenr"> 9: </span>            + <span style="color: #848ea9;">"\\s*\\("</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Opening parenthesis</span>
<span class="linenr">10: </span>            + <span style="color: #848ea9;">"\\s*([+|-]?(\\d+\\.?\\d*|\\.\\d+)|([a-zA-Z]\\w*))"</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">First argument</span>
<span class="linenr">11: </span>            + <span style="color: #848ea9;">"\\s*,\\s*"</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Comma</span>
<span class="linenr">12: </span>            + <span style="color: #848ea9;">"([+|-]?(\\d+\\.?\\d*|\\.\\d+)|([a-zA-Z]\\w*))"</span> <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Second argument</span>
<span class="linenr">13: </span>            + <span style="color: #848ea9;">"\\s*\\)"</span>; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Closing parenthesis</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">String regEx =</span>
<span class="linenr">16: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">"(Math.pow)\\s*\\(\\s*([+|-]?(\\d+\\.?\\d*|\\.\\d+)|([a-zA-Z]\\w*))\\s*,\\s*([+|-]?(\\d+\\.?\\d*|\\.\\d+)|([a-zA-Z]\\w*))\\s*\\)";</span>
<span class="linenr">17: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">oldCode</span> =
<span class="linenr">18: </span>        <span style="color: #848ea9;">"double result = Math.pow( 3.0, 16.0); "</span>
<span class="linenr">19: </span>            + <span style="color: #848ea9;">"\ndouble resultSquared = Math.pow(2 ,result );"</span>
<span class="linenr">20: </span>            + <span style="color: #848ea9;">"\ndouble hypotenuse = Math.sqrt(Math.pow(2.0, 30.0)+Math.pow(2 , 40.0));"</span>;
<span class="linenr">21: </span>    <span style="color: #0072b2; font-weight: bold;">Pattern</span> <span style="color: #e69f00; font-weight: bold;">pattern</span> = Pattern.compile(regEx);
<span class="linenr">22: </span>    <span style="color: #0072b2; font-weight: bold;">Matcher</span> <span style="color: #e69f00; font-weight: bold;">m</span> = pattern.matcher(oldCode);
<span class="linenr">23: </span>
<span class="linenr">24: </span>    <span style="color: #0072b2; font-weight: bold;">StringBuffer</span> <span style="color: #e69f00; font-weight: bold;">newCode</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">StringBuffer</span>();
<span class="linenr">25: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (m.find()) {
<span class="linenr">26: </span>      m.appendReplacement(newCode, <span style="color: #848ea9;">"$1\\($5,$2\\)"</span>);
<span class="linenr">27: </span>    }
<span class="linenr">28: </span>    m.appendTail(newCode);
<span class="linenr">29: </span>
<span class="linenr">30: </span>    System.out.println(<span style="color: #848ea9;">"Original Code:\n"</span> + oldCode.toString());
<span class="linenr">31: </span>    System.out.println(<span style="color: #848ea9;">"\nNew Code:\n"</span> + newCode.toString());
<span class="linenr">32: </span>  }
<span class="linenr">33: </span>}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org234fa75" class="outline-2">
<h2 id="org234fa75">ScanString</h2>
<div class="outline-text-2" id="text-org234fa75">
</div>
<div id="outline-container-orgd98332a" class="outline-3">
<h3 id="orgd98332a"><code>output</code></h3>
<div class="outline-text-3" id="text-orgd98332a">
<pre class="example">
String is:
Smith , where Jones had had 'had', had had 'had had'.
Token sought is: had
Token is    : Smith
Token is    : ,
Token is    : where
Token is    : Jones
Token found!: had
Token found!: had
Token is    : 'had',
Token found!: had
Token found!: had
Token is    : 'had
Token is    : had'.
4 instances of "had" were found.
</pre>
</div>
</div>
