programming/java/code/beginning/15.org
** =ScanString.java=

#+BEGIN_SRC java -n :tangle ScanString.java :padline no
  import java.util.Scanner;
  import java.util.regex.Pattern;

  public class ScanString {

    public static void main(String[] args) {

      String str = "Smith , where Jones had had 'had', had had 'had had'.";
      String regex = "had";
      System.out.println("String is:\n" + str + "\nToken sought is: " + regex);

      Pattern had = Pattern.compile(regex);
      Scanner strScan = new Scanner(str);
      // strScan.useDelimiter("\\s'|\\s*'?[.|,]\\s*|\\s");
      int hadCount = 0;
      while (strScan.hasNext()) {
        if (strScan.hasNext(had)) {
          ++hadCount;
          System.out.println("Token found!: " + strScan.next(had));
        } else {
          System.out.println("Token is    : " + strScan.next());
        }
      }
      System.out.println(hadCount + " instances of \"" + regex + "\" were found.");
    }
  }
#+END_SRC

* SearchAndReplace

** =output=

#+BEGIN_EXAMPLE
  My goat hasn't got any nose.
  How does your goat smell then?
  My goat smells horrible.
#+END_EXAMPLE

** =SearchAndReplace.java=

#+BEGIN_SRC java -n :tangle SearchAndReplace.java :padline no
  import java.util.regex.Matcher;
  import java.util.regex.Pattern;

  class SearchAndReplace {

    public static void main(String[] args) {
      String joke =
          "My dog hasn't got any nose.\n"
              + "How does your dog smell then?\n"
              + "My dog smells horrible.\n";
      String regEx = "dog";

      Pattern doggone = Pattern.compile(regEx);
      Matcher m = doggone.matcher(joke);

      StringBuffer newJoke = new StringBuffer();
      while (m.find()) {
        m.appendReplacement(newJoke, "goat");
      }
      m.appendTail(newJoke);
      System.out.println(newJoke.toString());
    }
  }
#+END_SRC

* SortingUsingComparator

** =output=

#+BEGIN_EXAMPLE
  Original order:
  Danielle Steel
  John Grisham
  Tom Clancy
  Christina Schwartz
  Patricia Cornwell
  Bill Bryson

  Order after sorting using comparator:
  Danielle Steel
  Christina Schwartz
  John Grisham
  Patricia Cornwell
  Tom Clancy
  Bill Bryson

  Order after sorting using Comparable method:
  Bill Bryson
  Tom Clancy
  Patricia Cornwell
  John Grisham
  Christina Schwartz
  Danielle Steel
#+END_EXAMPLE

