programming/java/code/beginning/15.html

<div id="outline-container-org8725458" class="outline-3">
<h3 id="org8725458"><code>ScanString.java</code></h3>
<div class="outline-text-3" id="text-org8725458">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Scanner</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Pattern</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">ScanString</span> {
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">str</span> = <span style="color: #848ea9;">"Smith , where Jones had had 'had', had had 'had had'."</span>;
<span class="linenr"> 9: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">regex</span> = <span style="color: #848ea9;">"had"</span>;
<span class="linenr">10: </span>    System.out.println(<span style="color: #848ea9;">"String is:\n"</span> + str + <span style="color: #848ea9;">"\nToken sought is: "</span> + regex);
<span class="linenr">11: </span>
<span class="linenr">12: </span>    <span style="color: #0072b2; font-weight: bold;">Pattern</span> <span style="color: #e69f00; font-weight: bold;">had</span> = Pattern.compile(regex);
<span class="linenr">13: </span>    <span style="color: #0072b2; font-weight: bold;">Scanner</span> <span style="color: #e69f00; font-weight: bold;">strScan</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Scanner</span>(str);
<span class="linenr">14: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">strScan.useDelimiter("\\s'|\\s*'?[.|,]\\s*|\\s");</span>
<span class="linenr">15: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">hadCount</span> = 0;
<span class="linenr">16: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (strScan.hasNext()) {
<span class="linenr">17: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (strScan.hasNext(had)) {
<span class="linenr">18: </span>        ++hadCount;
<span class="linenr">19: </span>        System.out.println(<span style="color: #848ea9;">"Token found!: "</span> + strScan.next(had));
<span class="linenr">20: </span>      } <span style="color: #56b4e9; font-weight: bold;">else</span> {
<span class="linenr">21: </span>        System.out.println(<span style="color: #848ea9;">"Token is    : "</span> + strScan.next());
<span class="linenr">22: </span>      }
<span class="linenr">23: </span>    }
<span class="linenr">24: </span>    System.out.println(hadCount + <span style="color: #848ea9;">" instances of \""</span> + regex + <span style="color: #848ea9;">"\" were found."</span>);
<span class="linenr">25: </span>  }
<span class="linenr">26: </span>}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6e0d370" class="outline-2">
<h2 id="org6e0d370">SearchAndReplace</h2>
<div class="outline-text-2" id="text-org6e0d370">
</div>
<div id="outline-container-org6970a32" class="outline-3">
<h3 id="org6970a32"><code>output</code></h3>
<div class="outline-text-3" id="text-org6970a32">
<pre class="example">
My goat hasn't got any nose.
How does your goat smell then?
My goat smells horrible.
</pre>
</div>
</div>

<div id="outline-container-org1eba874" class="outline-3">
<h3 id="org1eba874"><code>SearchAndReplace.java</code></h3>
<div class="outline-text-3" id="text-org1eba874">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Matcher</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">regex</span>.<span style="color: #0072b2; font-weight: bold;">Pattern</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">SearchAndReplace</span> {
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">joke</span> =
<span class="linenr"> 8: </span>        <span style="color: #848ea9;">"My dog hasn't got any nose.\n"</span>
<span class="linenr"> 9: </span>            + <span style="color: #848ea9;">"How does your dog smell then?\n"</span>
<span class="linenr">10: </span>            + <span style="color: #848ea9;">"My dog smells horrible.\n"</span>;
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">regEx</span> = <span style="color: #848ea9;">"dog"</span>;
<span class="linenr">12: </span>
<span class="linenr">13: </span>    <span style="color: #0072b2; font-weight: bold;">Pattern</span> <span style="color: #e69f00; font-weight: bold;">doggone</span> = Pattern.compile(regEx);
<span class="linenr">14: </span>    <span style="color: #0072b2; font-weight: bold;">Matcher</span> <span style="color: #e69f00; font-weight: bold;">m</span> = doggone.matcher(joke);
<span class="linenr">15: </span>
<span class="linenr">16: </span>    <span style="color: #0072b2; font-weight: bold;">StringBuffer</span> <span style="color: #e69f00; font-weight: bold;">newJoke</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">StringBuffer</span>();
<span class="linenr">17: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (m.find()) {
<span class="linenr">18: </span>      m.appendReplacement(newJoke, <span style="color: #848ea9;">"goat"</span>);
<span class="linenr">19: </span>    }
<span class="linenr">20: </span>    m.appendTail(newJoke);
<span class="linenr">21: </span>    System.out.println(newJoke.toString());
<span class="linenr">22: </span>  }
<span class="linenr">23: </span>}
</pre>
</div>
</div>
</div>
</div>
