programming/java/code/beginning/15.org
** =Person.java=

#+BEGIN_SRC java -n :tangle bs/Person.java :padline no
  public class Person implements Comparable<Person> {
    // Constructor
    public Person(String firstName, String surname) {
      this.firstName = firstName;
      this.surname = surname;
    }

    public String toString() {
      return firstName + " " + surname;
    }

    // Compare Person objects
    public int compareTo(Person person) {
      int result = surname.compareTo(person.surname);
      return result == 0 ? firstName.compareTo(person.firstName) : result;
    }

    public String getFirstName() {
      return firstName;
    }

    public String getSurname() {
      return surname;
    }

    private String firstName; // First name of person
    private String surname; // Second name of person
  }
#+END_SRC

** =TryBinarySearch.java=

#+BEGIN_SRC java -n :tangle bs/TryBinarySearch.java :padline no
  import java.util.Arrays;

  public class TryBinarySearch {

    public static void main(String[] args) {

      Person[] authors = {
        new Person("Danielle", "Steel"),
        new Person("John", "Grisham"),
        new Person("Tom", "Clancy"),
        new Person("Christina", "Schwartz"),
        new Person("Patricia", "Cornwell"),
        new Person("Bill", "Bryson")
      };

      Arrays.sort(authors); // Sort using Comparable method

      System.out.println("\nOrder after sorting into ascending sequence:");
      for (Person author : authors) {
        System.out.println(author);
      }

      // Search for authors
      Person[] people = {
        new Person("Christina", "Schwartz"),
        new Person("Ned", "Kelly"),
        new Person("Tom", "Clancy"),
        new Person("Charles", "Dickens")
      };
      int index = 0;
      System.out.println("\nIn search of authors:");
      for (Person person : people) {
        index = Arrays.binarySearch(authors, person);
        if (index >= 0) {
          System.out.println(person + " was found at index position " + index);
        } else {
          System.out.println(person + " was not found. Return value is " + index);
        }
      }
    }
  }
#+END_SRC

* Calendar

** =output=

#+BEGIN_EXAMPLE
  Enter your birth date as dd mm yyyy: 
  05 04 1949
  You were born on a Tuesday
  This year you are 71 years old.
  In 2020 your birthday was on a Sunday.
#+END_EXAMPLE

