programming/java/code/beginning/15.html

<div id="outline-container-org86bdc8e" class="outline-3">
<h3 id="org86bdc8e"><code>Person.java</code></h3>
<div class="outline-text-3" id="text-org86bdc8e">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Person</span> <span style="color: #56b4e9; font-weight: bold;">implements</span> <span style="color: #0072b2; font-weight: bold;">Comparable</span>&lt;<span style="color: #0072b2; font-weight: bold;">Person</span>&gt; {
<span class="linenr"> 2: </span>  <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Constructor</span>
<span class="linenr"> 3: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #d55e00;">Person</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">firstName</span>, <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">surname</span>) {
<span class="linenr"> 4: </span>    <span style="color: #56b4e9; font-weight: bold;">this</span>.firstName = firstName;
<span class="linenr"> 5: </span>    <span style="color: #56b4e9; font-weight: bold;">this</span>.surname = surname;
<span class="linenr"> 6: </span>  }
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">toString</span>() {
<span class="linenr"> 9: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> firstName + <span style="color: #848ea9;">" "</span> + surname;
<span class="linenr">10: </span>  }
<span class="linenr">11: </span>
<span class="linenr">12: </span>  <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Compare Person objects</span>
<span class="linenr">13: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">compareTo</span>(<span style="color: #0072b2; font-weight: bold;">Person</span> <span style="color: #e69f00; font-weight: bold;">person</span>) {
<span class="linenr">14: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">result</span> = surname.compareTo(person.surname);
<span class="linenr">15: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> result == 0 ? firstName.compareTo(person.firstName) : result;
<span class="linenr">16: </span>  }
<span class="linenr">17: </span>
<span class="linenr">18: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">getFirstName</span>() {
<span class="linenr">19: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> firstName;
<span class="linenr">20: </span>  }
<span class="linenr">21: </span>
<span class="linenr">22: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">getSurname</span>() {
<span class="linenr">23: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> surname;
<span class="linenr">24: </span>  }
<span class="linenr">25: </span>
<span class="linenr">26: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">firstName</span>; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">First name of person</span>
<span class="linenr">27: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">surname</span>; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Second name of person</span>
<span class="linenr">28: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga87554b" class="outline-3">
<h3 id="orga87554b"><code>TryBinarySearch.java</code></h3>
<div class="outline-text-3" id="text-orga87554b">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Arrays</span>;
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">TryBinarySearch</span> {
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">Person</span>[] <span style="color: #e69f00; font-weight: bold;">authors</span> = {
<span class="linenr"> 8: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"Danielle"</span>, <span style="color: #848ea9;">"Steel"</span>),
<span class="linenr"> 9: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"John"</span>, <span style="color: #848ea9;">"Grisham"</span>),
<span class="linenr">10: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"Tom"</span>, <span style="color: #848ea9;">"Clancy"</span>),
<span class="linenr">11: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"Christina"</span>, <span style="color: #848ea9;">"Schwartz"</span>),
<span class="linenr">12: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"Patricia"</span>, <span style="color: #848ea9;">"Cornwell"</span>),
<span class="linenr">13: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"Bill"</span>, <span style="color: #848ea9;">"Bryson"</span>)
<span class="linenr">14: </span>    };
<span class="linenr">15: </span>
<span class="linenr">16: </span>    Arrays.sort(authors); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Sort using Comparable method</span>
<span class="linenr">17: </span>
<span class="linenr">18: </span>    System.out.println(<span style="color: #848ea9;">"\nOrder after sorting into ascending sequence:"</span>);
<span class="linenr">19: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">Person</span> <span style="color: #e69f00; font-weight: bold;">author</span> : authors) {
<span class="linenr">20: </span>      System.out.println(author);
<span class="linenr">21: </span>    }
<span class="linenr">22: </span>
<span class="linenr">23: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Search for authors</span>
<span class="linenr">24: </span>    <span style="color: #0072b2; font-weight: bold;">Person</span>[] <span style="color: #e69f00; font-weight: bold;">people</span> = {
<span class="linenr">25: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"Christina"</span>, <span style="color: #848ea9;">"Schwartz"</span>),
<span class="linenr">26: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"Ned"</span>, <span style="color: #848ea9;">"Kelly"</span>),
<span class="linenr">27: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"Tom"</span>, <span style="color: #848ea9;">"Clancy"</span>),
<span class="linenr">28: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"Charles"</span>, <span style="color: #848ea9;">"Dickens"</span>)
<span class="linenr">29: </span>    };
<span class="linenr">30: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">index</span> = 0;
<span class="linenr">31: </span>    System.out.println(<span style="color: #848ea9;">"\nIn search of authors:"</span>);
<span class="linenr">32: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">Person</span> <span style="color: #e69f00; font-weight: bold;">person</span> : people) {
<span class="linenr">33: </span>      index = Arrays.binarySearch(authors, person);
<span class="linenr">34: </span>      <span style="color: #56b4e9; font-weight: bold;">if</span> (index &gt;= 0) {
<span class="linenr">35: </span>        System.out.println(person + <span style="color: #848ea9;">" was found at index position "</span> + index);
<span class="linenr">36: </span>      } <span style="color: #56b4e9; font-weight: bold;">else</span> {
<span class="linenr">37: </span>        System.out.println(person + <span style="color: #848ea9;">" was not found. Return value is "</span> + index);
<span class="linenr">38: </span>      }
<span class="linenr">39: </span>    }
<span class="linenr">40: </span>  }
<span class="linenr">41: </span>}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2cfb004" class="outline-2">
<h2 id="org2cfb004">Calendar</h2>
<div class="outline-text-2" id="text-org2cfb004">
</div>
<div id="outline-container-org1a69f92" class="outline-3">
<h3 id="org1a69f92"><code>output</code></h3>
<div class="outline-text-3" id="text-org1a69f92">
<pre class="example">
Enter your birth date as dd mm yyyy: 
05 04 1949
You were born on a Tuesday
This year you are 71 years old.
In 2020 your birthday was on a Sunday.
</pre>
</div>
</div>
