programming/java/code/beginning/15.org
** =InvalidUserInputException.java=

#+BEGIN_SRC java -n :tangle InvalidUserInputException.java :padline no
  public class InvalidUserInputException extends Exception {
    public InvalidUserInputException() {}

    public InvalidUserInputException(String message) {
      super(message);
    }
  }
#+END_SRC

** =TryCalendar.java=

#+BEGIN_SRC java -n :tangle TryCalendar.java :padline no
  import static java.util.Calendar.*;

  import java.text.DateFormatSymbols;
  import java.util.GregorianCalendar;

  class TryCalendar {
    public static void main(String[] args) {
      FormattedInput in = new FormattedInput();

      // Get the date of birth from the keyboard
      int day = 0;
      int month = 0;
      int year = 0;

      System.out.println("Enter your birth date as dd mm yyyy: ");
      try {
        day = in.readInt();
        month = in.readInt();
        year = in.readInt();
      } catch (InvalidUserInputException e) {
        System.out.println("Invalid input - terminating...");
        System.exit(1);
      }

      // Create birth date calendar - month is 0 to 11
      GregorianCalendar birthdate = new GregorianCalendar(year, month - 1, day);
      GregorianCalendar today = new GregorianCalendar(); // Today's date

      // Create this year's birthday
      GregorianCalendar birthday =
          new GregorianCalendar(today.get(YEAR), birthdate.get(MONTH), birthdate.get(DATE));

      int age = today.get(today.YEAR) - birthdate.get(YEAR);

      String[] weekdays = new DateFormatSymbols().getWeekdays(); // Get day names

      System.out.println("You were born on a " + weekdays[birthdate.get(DAY_OF_WEEK)]);
      System.out.println(
          "This year you " + (birthday.after(today) ? "will be " : "are ") + age + " years old.");
      System.out.println(
          "In "
              + today.get(YEAR)
              + " your birthday "
              + (today.before(birthday) ? "will be" : "was")
              + " on a "
              + weekdays[birthday.get(DAY_OF_WEEK)]
              + ".");
    }
  }
#+END_SRC

* CapturingGroups

** =output=

#+BEGIN_EXAMPLE
  Group 0: 256
  Group 1: 256
  Group 2: null
  Group 3: null
  Group 0: 16
  Group 1: 16
  Group 2: null
  Group 3: null
  Group 0: -2.5
  Group 1: 2.5
  Group 2: .5
  Group 3: null
  Group 0: 6.25
  Group 1: 6.25
  Group 2: .25
  Group 3: null
  Group 0: .243
  Group 1: null
  Group 2: null
  Group 3: .243
  Group 0: 0.1234
  Group 1: 0.1234
  Group 2: .1234
  Group 3: null
#+END_EXAMPLE

