programming/java/code/beginning/15.html

<div id="outline-container-org7e1d69c" class="outline-3">
<h3 id="org7e1d69c"><code>InvalidUserInputException.java</code></h3>
<div class="outline-text-3" id="text-org7e1d69c">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr">1: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">InvalidUserInputException</span> <span style="color: #56b4e9; font-weight: bold;">extends</span> <span style="color: #0072b2; font-weight: bold;">Exception</span> {
<span class="linenr">2: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #d55e00;">InvalidUserInputException</span>() {}
<span class="linenr">3: </span>
<span class="linenr">4: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #d55e00;">InvalidUserInputException</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">message</span>) {
<span class="linenr">5: </span>    <span style="color: #56b4e9; font-weight: bold;">super</span>(message);
<span class="linenr">6: </span>  }
<span class="linenr">7: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ca6ca1" class="outline-3">
<h3 id="org6ca6ca1"><code>TryCalendar.java</code></h3>
<div class="outline-text-3" id="text-org6ca6ca1">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #d55e00; font-weight: bold;">Calendar</span>.*;
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">text</span>.<span style="color: #0072b2; font-weight: bold;">DateFormatSymbols</span>;
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">GregorianCalendar</span>;
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">TryCalendar</span> {
<span class="linenr"> 7: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 8: </span>    <span style="color: #0072b2; font-weight: bold;">FormattedInput</span> <span style="color: #e69f00; font-weight: bold;">in</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">FormattedInput</span>();
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Get the date of birth from the keyboard</span>
<span class="linenr">11: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">day</span> = 0;
<span class="linenr">12: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">month</span> = 0;
<span class="linenr">13: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">year</span> = 0;
<span class="linenr">14: </span>
<span class="linenr">15: </span>    System.out.println(<span style="color: #848ea9;">"Enter your birth date as dd mm yyyy: "</span>);
<span class="linenr">16: </span>    <span style="color: #56b4e9; font-weight: bold;">try</span> {
<span class="linenr">17: </span>      day = in.readInt();
<span class="linenr">18: </span>      month = in.readInt();
<span class="linenr">19: </span>      year = in.readInt();
<span class="linenr">20: </span>    } <span style="color: #56b4e9; font-weight: bold;">catch</span> (<span style="color: #0072b2; font-weight: bold;">InvalidUserInputException</span> <span style="color: #e69f00; font-weight: bold;">e</span>) {
<span class="linenr">21: </span>      System.out.println(<span style="color: #848ea9;">"Invalid input - terminating..."</span>);
<span class="linenr">22: </span>      System.exit(1);
<span class="linenr">23: </span>    }
<span class="linenr">24: </span>
<span class="linenr">25: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Create birth date calendar - month is 0 to 11</span>
<span class="linenr">26: </span>    <span style="color: #0072b2; font-weight: bold;">GregorianCalendar</span> <span style="color: #e69f00; font-weight: bold;">birthdate</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">GregorianCalendar</span>(year, month - 1, day);
<span class="linenr">27: </span>    <span style="color: #0072b2; font-weight: bold;">GregorianCalendar</span> <span style="color: #e69f00; font-weight: bold;">today</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">GregorianCalendar</span>(); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Today's date</span>
<span class="linenr">28: </span>
<span class="linenr">29: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Create this year's birthday</span>
<span class="linenr">30: </span>    <span style="color: #0072b2; font-weight: bold;">GregorianCalendar</span> <span style="color: #e69f00; font-weight: bold;">birthday</span> =
<span class="linenr">31: </span>        <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">GregorianCalendar</span>(today.get(YEAR), birthdate.get(MONTH), birthdate.get(DATE));
<span class="linenr">32: </span>
<span class="linenr">33: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">age</span> = today.get(<span style="color: #d55e00; font-weight: bold;">today</span>.YEAR) - birthdate.get(YEAR);
<span class="linenr">34: </span>
<span class="linenr">35: </span>    <span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">weekdays</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">DateFormatSymbols</span>().getWeekdays(); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Get day names</span>
<span class="linenr">36: </span>
<span class="linenr">37: </span>    System.out.println(<span style="color: #848ea9;">"You were born on a "</span> + weekdays[birthdate.get(DAY_OF_WEEK)]);
<span class="linenr">38: </span>    System.out.println(
<span class="linenr">39: </span>        <span style="color: #848ea9;">"This year you "</span> + (birthday.after(today) ? <span style="color: #848ea9;">"will be "</span> : <span style="color: #848ea9;">"are "</span>) + age + <span style="color: #848ea9;">" years old."</span>);
<span class="linenr">40: </span>    System.out.println(
<span class="linenr">41: </span>        <span style="color: #848ea9;">"In "</span>
<span class="linenr">42: </span>            + today.get(YEAR)
<span class="linenr">43: </span>            + <span style="color: #848ea9;">" your birthday "</span>
<span class="linenr">44: </span>            + (today.before(birthday) ? <span style="color: #848ea9;">"will be"</span> : <span style="color: #848ea9;">"was"</span>)
<span class="linenr">45: </span>            + <span style="color: #848ea9;">" on a "</span>
<span class="linenr">46: </span>            + weekdays[birthday.get(DAY_OF_WEEK)]
<span class="linenr">47: </span>            + <span style="color: #848ea9;">"."</span>);
<span class="linenr">48: </span>  }
<span class="linenr">49: </span>}
</pre>
</div>
</div>
</div>
</div>
