programming/java/code/beginning/15.org
** =Horrific.java=

#+BEGIN_SRC java -n :tangle obs/Horrific.java :padline no
  // Try out observers
  import java.util.Observer;

  public class Horrific {

    public static void main(String[] args) {

      JekyllAndHyde man = new JekyllAndHyde(); // Create Dr. Jekyll

      Observer[] crowd = {
        new Person("Officer", "What's all this then?"),
        new Person("Eileen Backwards", "Oh, no, it's horrible - those teeth!"),
        new Person("Phil McCavity", "I'm your local dentist - here's my card."),
        new Person("Slim Sagebrush", "What in tarnation's goin' on here?"),
        new Person("Freaky Weirdo", "Real cool, man. Where can I get that stuff?")
      };

      // Add the observers
      for (Observer observer : crowd) {
        man.addObserver(observer);
      }

      man.drinkPotion(); // Dr. Jekyll drinks up
    }
  }
#+END_SRC

** =JekyllAndHyde.java=

#+BEGIN_SRC java -n :tangle obs/JekyllAndHyde.java :padline no
  import java.util.Observable;

  public class JekyllAndHyde extends Observable {

    public void drinkPotion() {
      name = "Mr.Hyde";
      setChanged();
      notifyObservers();
    }

    public String getName() {
      return name;
    }

    private String name = "Dr. Jekyll";
  }
#+END_SRC

** =Person.java=

#+BEGIN_SRC java -n :tangle obs/Person.java :padline no
  import java.util.Observable;
  import java.util.Observer;

  public class Person implements Observer {

    // Constructor
    public Person(String name, String says) {
      this.name = name;
      this.says = says;
    }

    // Called when observing an object that changes
    public void update(Observable thing, Object o) {
      System.out.println("It's " + ((JekyllAndHyde) thing).getName() + "\n" + name + ": " + says);
    }

    private String name; // Person's identity
    private String says; // What they say when startled
  }
#+END_SRC

* Scanner

** =output=

#+BEGIN_EXAMPLE
  Enter an integer: 42
  You entered: 42
  Enter a floating-point value: 10
  You entered: 10.0
  Enter a boolean value(true or false): false
  You entered: false
#+END_EXAMPLE

