programming/java/code/beginning/15.html

<div id="outline-container-org8bda4b9" class="outline-2">
<h2 id="org8bda4b9">Observer</h2>
<div class="outline-text-2" id="text-org8bda4b9">
</div>
<div id="outline-container-orgb76c0c0" class="outline-3">
<h3 id="orgb76c0c0"><code>output</code></h3>
<div class="outline-text-3" id="text-orgb76c0c0">
<pre class="example">
$ java Horrific
It's Mr.Hyde
Freaky Weirdo: Real cool, man. Where can I get that stuff?
It's Mr.Hyde
Slim Sagebrush: What in tarnation's goin' on here?
It's Mr.Hyde
Phil McCavity: I'm your local dentist - here's my card.
It's Mr.Hyde
Eileen Backwards: Oh, no, it's horrible - those teeth!
It's Mr.Hyde
Officer: What's all this then?
</pre>
</div>
</div>

<div id="outline-container-orgfdb545c" class="outline-3">
<h3 id="orgfdb545c"><code>Horrific.java</code></h3>
<div class="outline-text-3" id="text-orgfdb545c">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Try out observers</span>
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Observer</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Horrific</span> {
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    <span style="color: #0072b2; font-weight: bold;">JekyllAndHyde</span> <span style="color: #e69f00; font-weight: bold;">man</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">JekyllAndHyde</span>(); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Create Dr. Jekyll</span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    <span style="color: #0072b2; font-weight: bold;">Observer</span>[] <span style="color: #e69f00; font-weight: bold;">crowd</span> = {
<span class="linenr">11: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"Officer"</span>, <span style="color: #848ea9;">"What's all this then?"</span>),
<span class="linenr">12: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"Eileen Backwards"</span>, <span style="color: #848ea9;">"Oh, no, it's horrible - those teeth!"</span>),
<span class="linenr">13: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"Phil McCavity"</span>, <span style="color: #848ea9;">"I'm your local dentist - here's my card."</span>),
<span class="linenr">14: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"Slim Sagebrush"</span>, <span style="color: #848ea9;">"What in tarnation's goin' on here?"</span>),
<span class="linenr">15: </span>      <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Person</span>(<span style="color: #848ea9;">"Freaky Weirdo"</span>, <span style="color: #848ea9;">"Real cool, man. Where can I get that stuff?"</span>)
<span class="linenr">16: </span>    };
<span class="linenr">17: </span>
<span class="linenr">18: </span>    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Add the observers</span>
<span class="linenr">19: </span>    <span style="color: #56b4e9; font-weight: bold;">for</span> (<span style="color: #0072b2; font-weight: bold;">Observer</span> <span style="color: #e69f00; font-weight: bold;">observer</span> : crowd) {
<span class="linenr">20: </span>      man.addObserver(observer);
<span class="linenr">21: </span>    }
<span class="linenr">22: </span>
<span class="linenr">23: </span>    man.drinkPotion(); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Dr. Jekyll drinks up</span>
<span class="linenr">24: </span>  }
<span class="linenr">25: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0545fbd" class="outline-3">
<h3 id="org0545fbd"><code>JekyllAndHyde.java</code></h3>
<div class="outline-text-3" id="text-org0545fbd">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Observable</span>;
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">JekyllAndHyde</span> <span style="color: #56b4e9; font-weight: bold;">extends</span> <span style="color: #0072b2; font-weight: bold;">Observable</span> {
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">drinkPotion</span>() {
<span class="linenr"> 6: </span>    name = <span style="color: #848ea9;">"Mr.Hyde"</span>;
<span class="linenr"> 7: </span>    setChanged();
<span class="linenr"> 8: </span>    notifyObservers();
<span class="linenr"> 9: </span>  }
<span class="linenr">10: </span>
<span class="linenr">11: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #d55e00;">getName</span>() {
<span class="linenr">12: </span>    <span style="color: #56b4e9; font-weight: bold;">return</span> name;
<span class="linenr">13: </span>  }
<span class="linenr">14: </span>
<span class="linenr">15: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">name</span> = <span style="color: #848ea9;">"Dr. Jekyll"</span>;
<span class="linenr">16: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ce831c" class="outline-3">
<h3 id="org3ce831c"><code>Person.java</code></h3>
<div class="outline-text-3" id="text-org3ce831c">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Observable</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Observer</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">Person</span> <span style="color: #56b4e9; font-weight: bold;">implements</span> <span style="color: #0072b2; font-weight: bold;">Observer</span> {
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>  <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Constructor</span>
<span class="linenr"> 7: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #d55e00;">Person</span>(<span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">name</span>, <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">says</span>) {
<span class="linenr"> 8: </span>    <span style="color: #56b4e9; font-weight: bold;">this</span>.name = name;
<span class="linenr"> 9: </span>    <span style="color: #56b4e9; font-weight: bold;">this</span>.says = says;
<span class="linenr">10: </span>  }
<span class="linenr">11: </span>
<span class="linenr">12: </span>  <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Called when observing an object that changes</span>
<span class="linenr">13: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">update</span>(<span style="color: #0072b2; font-weight: bold;">Observable</span> <span style="color: #e69f00; font-weight: bold;">thing</span>, <span style="color: #0072b2; font-weight: bold;">Object</span> <span style="color: #e69f00; font-weight: bold;">o</span>) {
<span class="linenr">14: </span>    System.out.println(<span style="color: #848ea9;">"It's "</span> + ((<span style="color: #0072b2; font-weight: bold;">JekyllAndHyde</span>) thing).getName() + <span style="color: #848ea9;">"\n"</span> + name + <span style="color: #848ea9;">": "</span> + says);
<span class="linenr">15: </span>  }
<span class="linenr">16: </span>
<span class="linenr">17: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">name</span>; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Person's identity</span>
<span class="linenr">18: </span>  <span style="color: #56b4e9; font-weight: bold;">private</span> <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">says</span>; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">What they say when startled</span>
<span class="linenr">19: </span>}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdd058ae" class="outline-2">
<h2 id="orgdd058ae">Scanner</h2>
<div class="outline-text-2" id="text-orgdd058ae">
</div>
<div id="outline-container-org5ee151b" class="outline-3">
<h3 id="org5ee151b"><code>output</code></h3>
<div class="outline-text-3" id="text-org5ee151b">
<pre class="example">
Enter an integer: 42
You entered: 42
Enter a floating-point value: 10
You entered: 10.0
Enter a boolean value(true or false): false
You entered: false
</pre>
</div>
</div>
