programming/java/code/beginning/15.html

<div id="outline-container-orga330ca3" class="outline-3">
<h3 id="orga330ca3"><code>TryScanner.java</code></h3>
<div class="outline-text-3" id="text-orga330ca3">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">InputMismatchException</span>;
<span class="linenr"> 2: </span><span style="color: #56b4e9; font-weight: bold;">import</span> <span style="color: #d55e00; font-weight: bold;">java</span>.<span style="color: #d55e00; font-weight: bold;">util</span>.<span style="color: #0072b2; font-weight: bold;">Scanner</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">class</span> <span style="color: #0072b2; font-weight: bold;">TryScanner</span> {
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>  <span style="color: #56b4e9; font-weight: bold;">public</span> <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">String</span>[] <span style="color: #e69f00; font-weight: bold;">args</span>) {
<span class="linenr"> 7: </span>    <span style="color: #0072b2; font-weight: bold;">Scanner</span> <span style="color: #e69f00; font-weight: bold;">kbScan</span> = <span style="color: #56b4e9; font-weight: bold;">new</span> <span style="color: #0072b2; font-weight: bold;">Scanner</span>(System.in); <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Create the scanner</span>
<span class="linenr"> 8: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">selectRead</span> = 1; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Selects the read operation</span>
<span class="linenr"> 9: </span>    <span style="color: #56b4e9; font-weight: bold;">final</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">MAXTRIES</span> = 3; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Maximum attempts at input</span>
<span class="linenr">10: </span>    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">tries</span> = 0; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Number of input attempts</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span>    <span style="color: #56b4e9; font-weight: bold;">while</span> (tries &lt; <span style="color: #0072b2; font-weight: bold;">MAXTRIES</span>) {
<span class="linenr">13: </span>      <span style="color: #56b4e9; font-weight: bold;">try</span> {
<span class="linenr">14: </span>        <span style="color: #56b4e9; font-weight: bold;">switch</span> (selectRead) {
<span class="linenr">15: </span>          <span style="color: #56b4e9; font-weight: bold;">case</span> 1:
<span class="linenr">16: </span>            System.out.print(<span style="color: #848ea9;">"Enter an integer: "</span>);
<span class="linenr">17: </span>            System.out.println(<span style="color: #848ea9;">"You entered: "</span> + kbScan.nextLong());
<span class="linenr">18: </span>            ++selectRead; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Select next read operation</span>
<span class="linenr">19: </span>            tries = 0; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Reset count of tries</span>
<span class="linenr">20: </span>
<span class="linenr">21: </span>          <span style="color: #56b4e9; font-weight: bold;">case</span> 2:
<span class="linenr">22: </span>            System.out.print(<span style="color: #848ea9;">"Enter a floating-point value: "</span>);
<span class="linenr">23: </span>            System.out.println(<span style="color: #848ea9;">"You entered: "</span> + kbScan.nextDouble());
<span class="linenr">24: </span>            ++selectRead; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Select next read operation</span>
<span class="linenr">25: </span>            tries = 0; <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">Reset count of tries</span>
<span class="linenr">26: </span>
<span class="linenr">27: </span>          <span style="color: #56b4e9; font-weight: bold;">case</span> 3:
<span class="linenr">28: </span>            System.out.print(<span style="color: #848ea9;">"Enter a boolean value(true or false): "</span>);
<span class="linenr">29: </span>            System.out.println(<span style="color: #848ea9;">"You entered: "</span> + kbScan.nextBoolean());
<span class="linenr">30: </span>        }
<span class="linenr">31: </span>        <span style="color: #56b4e9; font-weight: bold;">break</span>;
<span class="linenr">32: </span>      } <span style="color: #56b4e9; font-weight: bold;">catch</span> (<span style="color: #0072b2; font-weight: bold;">InputMismatchException</span> <span style="color: #e69f00; font-weight: bold;">e</span>) {
<span class="linenr">33: </span>        <span style="color: #0072b2; font-weight: bold;">String</span> <span style="color: #e69f00; font-weight: bold;">input</span> = kbScan.next();
<span class="linenr">34: </span>        System.out.println(<span style="color: #848ea9;">"\""</span> + input + <span style="color: #848ea9;">"\" is not valid input."</span>);
<span class="linenr">35: </span>        <span style="color: #56b4e9; font-weight: bold;">if</span> (tries &lt; <span style="color: #0072b2; font-weight: bold;">MAXTRIES</span>) {
<span class="linenr">36: </span>          System.out.println(<span style="color: #848ea9;">"Try again."</span>);
<span class="linenr">37: </span>        } <span style="color: #56b4e9; font-weight: bold;">else</span> {
<span class="linenr">38: </span>          System.out.println(<span style="color: #848ea9;">" Terminating program."</span>);
<span class="linenr">39: </span>          System.exit(1);
<span class="linenr">40: </span>        }
<span class="linenr">41: </span>      }
<span class="linenr">42: </span>    }
<span class="linenr">43: </span>  }
<span class="linenr">44: </span>}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
